package by.vstu.dean.enums;

public enum EChangeReason {
    //0- нет отклонения
    //1- в АО *
    //2- был в АО - это не нужно
    //3- отчислен *
    //4- восстановлен с др.базы - нужно ли?
    //5- вернулся с АО с др.базы - нужно ли?
    //6- восстановлен с тек. базы
    //10- смена фамилии *
    //11- в АО + смена фамилии *
    //12- был в АО + смена фамилии
    //13- сменил фамилию и отчислен
    //14- восстановлен с др.базы + смена фамилии
    //15- вернулся с АО с другой базы + смена фамилии
    //16- восстановлен с тек. базы + смена фамилии
    //41- восстановлен и ушел в АО

    //многое из этого больше не нужно, но нужно сохранять совместимость со старым деканатом...


}
